<template>
    <v-app id="EULA">
        <div class="eula">

            <span class="eula_title">{{ $t('Text.EULA.subtitle') }}</span>
            <p style="font-size: 14px; color: #909399; font-weight: bold">生效时间: 2022/01/01</p>
            <v-btn style="position: absolute; right: 25.5%" :depressed="true" small><v-icon>arrow_back</v-icon>返回上一步</v-btn>
            <div class="tos" id="tos">
                <h3>服务条款</h3>
                <p>注册RealFax即表示您接受我们的隐私政策并同意不会:</p>
                <ul>
                    <li>使用我们的服务发送垃圾邮件或诈骗用户。</li>
                    <li>在公开可查看的RealFax频道、产权、群组等上宣传暴力</li>
                    <li>在公开可查看的RealFax频道、产权、群组等上发布非法色情内容</li>
                </ul>
            </div>

            <div class="privacy" id="privacy">
                <h3>隐私政策</h3>

                <h4>一、简介</h4>
                <p>本隐私政策规定了我们RealFax Messenger Inc. <b>("RealFax")</b>如何使用和保护您提供给我们或我们以其他方式获得或生成的与您使用我们基于云的数据相关的个人数据消息 <b>("服务")</b>。就隐私政策而言, "我们"和"我们的"是指RealFax, 而"您"是指您, 即服务的用户。</p>

                <h4>1.1 隐私原则</h4>
                <p>RealFax 在收集和处理私人数据方面有两个基本原则:</p>
                <ul>
                    <li>我们不会使用您的数据向您展示广告。</li>
                    <li>我们仅储存RealFax作为安全且功能丰富的消息传递服务所需的数据</li>
                </ul>

                <h4>1.2. 服务条款</h4>
                <p>本隐私政策构成我们服务条款的一部分,该条款描述了您使用我们服务的条款, 可在<el-link type="primary" href="https://realfax.org/tos" :underline="false">https://realfax.org/tos</el-link>找到。因此,应结合这些条款阅读本隐私政策</p>

                <h4>1.3. 目录</h4>
                <p>本隐私政策解释如下</p>
                <ul>
                    <li>处理您的个人数据的法律依据;</li>
                    <li>我们可能会从您那里收集哪些个人数据;</li>
                    <li>我们如何确保您的个人数据安全;</li>
                    <li>我们可能将您的个人数据用于什么目的;</li>
                    <li>您的个人数据可能与谁共享;</li>
                    <li>您对个人数据的权利</li>
                </ul>

                <h4>2. 处理您的个人数据的法律依据</h4>
                <p>我们处理您的个人数据的理由是, 此类处理对于促进我们的合法利益是必要的(包括: <i>(1)</i> 向我们的用户提高有效和创新的服务;以及 <i>(2)</i>检测、预防或以其他方式解决有关欺诈或安全问题我们提供的服务），除非您的利益或需要保护个人数据的基本权利和自由凌驾于这些利益之上。)</p>

                <h4>3. 我们使用哪些个人数据</h4>

                <h4>3.1. 基本账户数据</h4>
                <p>RealFax是一种通信服务。您提供您的手机号码和基本帐户数据（可能包括个人资料名称、个人资料图片和关于信息）以创建 RealFax 帐户。</p>
                <p>为了让您的联系人和其他人更容易联系到您并识别您的身份，您在 RealFax 上选择的屏幕名称、您的个人资料图片和您的用户名（如果您选择设置）始终是公开的。我们不想知道您的真实姓名、性别、年龄或您喜欢什么。</p>
                <p>我们 <b>不</b> 要求您的网名是您的真实姓名。请注意，联系人中包含您的用户将通过他们保存的姓名而不是您的屏幕名称看到您。这样，您的母亲可以拥有公共名称“约翰尼·德普”，同时对您来说是“妈妈”，在工作中对她的下属来说是“老板”（或者反过来，取决于这些关系的结构）。</p>

                <h4>3.2. 您的电子邮件地址</h4>
                <p>当您使用 RealFax Passport 功能为您的帐户或商店文档启用两步验证时，您可以选择设置密码恢复电子邮件。如果您忘记了密码恢复代码，此地址将仅用于向您发送密码恢复代码。没错: 没有营销或"我们想念你"这些废话。</p>

                <h4>3.3 您的留言</h4>

                <h4>3.3.1. 云聊天</h4>
                <p>RealFax是一种云服务。我们将来自您的<i>云聊天</i>的消息、照片、视频与文档储存在我们的服务器上,以便您可以随时从您的任何设备访问您的数据,而无需依赖第三方备份。所有数据都经过高强度的加密储存, 每种情况下的加密密钥都储存在不同的司法辖区的其他几个数据中心中。这 <i>样本地工程师</i> 或 <i>物理入侵者</i> 就无法访问用户数据</p>

                <h4>3.3.2. 面对面聊天</h4>
                <p><i>面对面聊天</i>使用了 <b>"Point-to-Point"(P2P)</b>技术使两个人的聊天消息不经过服务器就能到达对方手中, 当您发起新的 <i>面对面聊天</i>时会使用区块链技术来保卫您的隐私安全。这意味着所有数据都是用只有您和收信人知道的密钥进行加密。我们不知道您何时发起了 <i>面对面聊天</i>。出于同样的原因, 在云中不提供秘密聊天, 您只能从它们被发送到或从您的设备中访问到这些消息</p>

                <h4>3.3.3. 面对面聊天中的媒体</h4>
                <p>当您通过<i>面对面聊天</i>发送照片、视频或文件时, 这个过程服务器不会知道, 在运营商看来这些流量就像是一辆拉上窗帘的车子</p>

                <h4>3.3.4. 公开聊天</h4>
                <p>除了私信, RealFax还支持公共频道和公共群组。所有公共聊天都是云聊天(请参阅上面的3.3.1节)。就像RealFax上的所有内容一样, 您在公共社区中发布的数据在储存和传输过程中都是经过特殊加密的--但您在公共场合发布的所有内容都可供所有人访问</p>

                <h4>3.4. 电子邮件和电话号码</h4>
                <p>RealFax使用电子邮件地址作为唯一标识符, <i>我们将会对部分电子邮件服务器进行封禁</i></p>
                <p>RealFax同时允许您将电话号码作为唯一标识符, 因此您可以轻松地从SMS和其他消息传递应用程序切换并保留您的社交图谱。在同步您的联系人之前, 我们会征求您的许可</p>

                <h4>3.5 位置数据</h4>
                <p>如果您在聊天中共享一个位置, 则此位置数据分别被视为 云(3.3.1) 和 面对面聊天(3.3.1) 中的其他消息</p>

                <h4>3.6 Cookie</h4>
                <p>我们使用的唯一cookie时用于在网络上操作和提供我们的服务的cookie。我们不会将cookie用于分析或广告。我们使用cookie时小型文本文件, 允许我们提供和定制我们的服务, 从而为您提供增强的用户体验。您的浏览器应允许您控制这些cookie, 包括是否接受它们以及如何删除它们。您可以选择使用您的网络浏览器阻止cookie, 但是如果您禁用这些cookie您将无法登录RealFax Web</p>

                <h3><b>final</b> 本隐私政策的变更</h3>
                <p>我们将不时审查并可能更新本隐私政策。当我们在此页面 <el-link type="primary" :underline="false" :href="finalLink">{{ finalLink }}</el-link> 上发布修订后的隐私政策时, 对本隐私政策的任何更改将生效。请经常查看我们的网站以查看我们隐私政策的任何更新或更改, 我们将在下面列出其摘要。</p>

            </div>

        </div>
    </v-app>
</template>

<script>
export default {
    name: 'EULA',
    data() {
        return {
            finalLink: ''
        }
    },
    mounted() {
        this.finalLink = window.location.href.replace("https://", "").replace("http://", "");
    }
}
</script>

<style>
body::-webkit-scrollbar {
    display: none;
}
.eula {
    width: 50%;
    margin-left: 25%;
    text-align: left;

}
.eula p {
    font-size: 14px;
}
.eula ul {
    font-size: 14px;
}
.eula_title {
    font-size: 4vw;
}
.privacy {

}
</style>
